1) Данные можно ввести из текстового файла
2) желательно, чтобы ошибок в файле не было, обработчики ошибок всё не предусматривают

формат текстового файла:

первая строка:
4 6 - размеры массивов A и B
вторая строка:
14 7 22 17 - массив А
третья строка
7 12 3 11 8 20 - массив В
далее Length(A) строк:  матрица С
1,1 2 2,05 1 3 0,5
3 2,15 4,8 3 11,07 2,2
0,8 1 0,75 2,12 0,1 2,8
0,7 3 1,1 3,7 1 0,2

! в десятичных дробях: дробная часть отделяются от целых ЗАПЯТОЙ
!! В конце строк не должно быть пробелов

Примеры текстовых файлов лежат тут же в папке ПРИМЕРЫ

3) brotherofken1@yandex.ru - для пожеланий и замечаний.